{
  "megamod_subtitle": "Разработчик многих продуктов одного из самых революционных стартапов. Блин, его даже на канале Forbes показывали! Больше 70 тыс. игр было создано с помощью MegaMod.",
  "megamod_description": "- Работа в прекрасной команде\n- Интенсивное использование мультиплеера Photon\n- Работа с WebGL\n- Оптимизация игры\n- Создание инструментов редактора\n- Добавление геймплейных фичей\n- Создание инфраструктуры для команды (телеграм бот для ежедневных отчетов)",
  "megamod_content": "Это информация о компании.",
  "chillage_subtitle": "Proof-of-concept, который проверил меня на прочность. Игра была создана с нуля на языке C. Без движка. Без библиотек. Всё свое, всё handmade",
  "chillage_description": "Это описание для моего сайта.",
  "chillage_content": "Это информация о компании.",
  "megacode_subtitle": "Один из хедлайнеров компании, который я сделал за один марафон. Вы можете запрограммировать любой предмет обычными словами! Прям вот на разговорном you know блин!",
  "megacode_description": "Босс постучался в мой раскошный кабинет, и сказал: 'Гриша, спасай эту компанию, нам нужны инвестиции! Нам нужен продукт на стыке передовых технологий! И чтобы помещалось в карман'\n – Говно вопрос, Босс!\n\nНо на самом деле это достаточно не тривиальная задача, потому что мне пришлось соединить Roslyn, AOT, CIL interpreter и еще несколько умных слов так, чтобы это все работало, да еще и прямо в браузере! Да еще и мобильную версию сделали, в которой можно одним голосом надиктовать геймобжекту, что ему надо делать. Пришлось сильно много подумать, но я решил эту задачу.\nНиже напишу как...",
  "megacode_content": "как\n\nНу а если серьезно, то нет у меня никакого роскошного кабинета, и я под NDA.\nДанный прототип использовался на внутренних встречах CEO компании с уважаемыми людьми на всей территории Кремниевой Долины и не только. Сооснователь Mail.ru — Дмитрий Гришин, продакт-мендежер Discord, какие-то чуваки из OpenAI и еще много кто играли в эту игру и оценили ее потенциал",
  "megaobby_subtitle": "Мое видение того, как должны выглядеть Obby игры. Написана на низкоуровневом Playroom мультиплеере. Будет одной из фичернутых Дискордом игр. Все еще в разработке.",
  "megaobby_description": "",
  "megaobby_content": "Это информация о компании.",
  "tyrant_subtitle": "Она стоила нам целую шаурмечную!",
  "tyrant_description": "Один из моих самых любимых проектов, на котором я попробовал огромное количество новых подходов к программированию. Он был многообещающим, но его ждала печальная судьба. Сначала у главного идеолога появились проблемы с его шаурмечной, из-за чего проект был заморожен на несколько месяцев. А потом денег хватило еще на месяц разработки, после чего главарю пришлось перейти на дешевых студентов, а я был вынужден решать: работать за будущие проценты или уйти в MegaMod за настоящие доллары.",
  "tyrant_content": "Шаурмы не будет.\nНо зато есть пара интересных фактов:\n- Это первая игра, в которой я пощупал DOTS и сделал ультра быстрый A* патфайндер.\n- Архитектура игры была выстроена таким образом, чтобы каждая сущность могла иметь абсолютно любые абилки, паттерны поведения и использовать синергию эффектов. Можно буквально в один клик сделать какой-нибудь забор агрессивным и стреляющим фаерболлами, которые замедляют других сущностей; а если они еще в снег наступят... удачи им.\n- Я помогал найти на проект достойную, но дешевую версию себя. Через меня прошло более 30 джуниоров. Дорогой HR, если ты читаешь это, то я тебя искренне понимаю, держись!",
  "notalone_subtitle": "*решением Верховного суда «международное движение ЛГБТ» признано экстремистским и запрещено в России",
  "notalone_description": "Некоторые вещи хочется забыть, но в портфолио же нужно что-то положить...\n1.1 тыс. отзывов все же!",
  "notalone_content": "В далеком 2019 году мы начали разработку многообещающего проекта. На первых этапах я составлял 50% работников по количеству и 70% по массе в киллограммах. Это был мой первый опыт работы с клиент-серверными приложениями, вебсокетами, REST, и т.п.\nТак же на меня легли обязанности по реализации большого количества механик и UI анимаций. Команда росла, я учился взаимодействовать с другими разработчкиками и художниками, пытался координировать работу команды, и просто работать на качество.",
  "sketch_subtitle": "Мой первый большой соло проект. И огромное количество технических вызовов.",
  "sketch_description": "Казалось бы, что сложного сделать обычную раскраску, где надо выбирать цвет и тыкать? Ну давайте подумаем...",
  "sketch_content": "Для начала нам нужно создать воркфлоу для художников. Мы же не хотим, чтобы они тратили лишнее время на всякую фигню. Поэтому мы пишем с нуля скрипт для Illustrator (я никогда не писал JS скрипты, но долг зовет), который нарезает картинки по слоям с цветовой кодировкой. Далее нам нужно написать с нуля PSD импортер (пустяки, да ведь?), который будет автоматически создавать префаб раскраски со всеми нужными слоями.\nОй, погодите, нам же нужны номера цветов! Заставим художников тратить еще пару часов на это? Лучше напишем свой алгоритм по поиску геометрического центра (pole of inaccessibility) любой формы! Но для начала узнаем, как это вообще работает.\nОкей, круто, теперь мы генерируем даже номера. Теперь давайте наладим content delivery! Вы знаете как это делать? Я нет! Это нам когда-то мешало? Изучаем AWS S3, CDN, изучаем Unity Adressables. Вот теперь уже неплохо! Встраиваем рекламу и продаем на китайский рынок! (я конечно не этого хотел, но да ладно)."
}
